👍 **terraform plan : 成功**
✅ 正しく適用が可能です。内容は以下を確認してください。

### Show Plan
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test_bucket will be created
  + resource "aws_s3_bucket" "test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Terraform Test Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Terraform Test Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + object_lock_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)
    }

  # random_pet.bucket_name will be created
  + resource "random_pet" "bucket_name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
stdout<<ghadelimiter_dbe924b1-7558-4686-a89e-209728af464f

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test_bucket will be created
  + resource "aws_s3_bucket" "test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Terraform Test Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Terraform Test Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + object_lock_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)
    }

  # random_pet.bucket_name will be created
  + resource "random_pet" "bucket_name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_dbe924b1-7558-4686-a89e-209728af464f
stderr<<ghadelimiter_1adc9d48-18ef-447c-a9db-852d1fab6f21

ghadelimiter_1adc9d48-18ef-447c-a9db-852d1fab6f21
exitcode<<ghadelimiter_01c17872-00a7-4f09-8e24-eb75db7fc17b
0
ghadelimiter_01c17872-00a7-4f09-8e24-eb75db7fc17b
```
